# Модуль, отвечающий за взаимодействие с
# ядром приложения: разбор команд, хранение
# заметок и напоминаний и т.д.

# 
# autor:   lis
# created: 2021.02.12 10:00:53
# 





# Выполняет команду; команда представляет собой
# непосредственно тот текст, который ввёл пользователь;
# при неудаче возбуждает исключение (какое?)
def execute(text):
	pass



# Возвращает и удаляет из очереди напоминание,
# если есть; иначе возвращает None
def get_notice():
	return None



# Возвращает только что удалённое
# из очереди напоминание обратно;
# если такового нет, то возбуждается
# исключение (какое?)
def unget_notice():
	pass





# END
